Revit 2026 API

# SweepPath3d Property

---

The selected curves used for the sweep path.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Path3d Path3d { get; }
```
```vb
Public ReadOnly Property Path3d As Path3d
	Get
```
```cpp
public:
property Path3d^ Path3d {
	Path3d^ get ();
}
```
```fsharp
member Path3d : Path3d with get
```

#### Property Value

Path3d

If the sweep is based on a sketched path, this property is .

#### Reference

Sweep Class

Autodesk.Revit.DB Namespace